#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>


//建议把p32 28.这一集重看
/*int main()
{
	int i = -20;
	//1000 0000 0000 0000 0000 0000 0001 0100
	//1111 1111 1111 1111 1111 1111 1110 1011
	//1111 1111 1111 1111 1111 1111 1110 1100
	unsigned int j = 10;
	//0000 0000 0000 0000 0000 0000 0000 1010--因为是正数，所以原、反、补相同
	printf("%d ", i + j);//两者相加时是用补码相加
	//i+j=
	//1111 1111 1111 1111 1111 1111 1111 0110补码
	//1111 1111 1111 1111 1111 1111 1111 0101反码
	//1000 0000 0000 0000 0000 0000 0000 1010原码
	return 0;
}*/
#include <windows.h>
int main()
{
	unsigned int i = 9;//因为unsigned的原因，所以i不可能为负数
	//
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n", i);
		Sleep(1000);//这一步只是为了让程序走慢点
	}
	
	return 0;
}